/*
 * Задача b7: Задача по DOM. Представьте, что у вас есть верстка, где более 100 кнопок, у которых схожие обработчики,
 * навешивать обработчик на каждую кнопку дорого, как бы вы написали код, чтобы обойтись одним обработчиком
 * Напишите куда бы вы его повесили и саму функцию
 * Задача такая, допустим на странице есть 100 контейнеров - тег <div />,
 * у каждого такого контейнера есть класс '.btn-secondary',
 * у каждой есть уникальный id, нужно при клике на контейнер вывести в консоль id
 */
