/*
  Всем советую книгу Дэвид Флэнаган "JavaScript. Подробное руководство" (6-е издание) (2012, PDF)
  Там нет es6, но очень подробно объяснены основы

  css тоже нужно знать поэтому рекомендую RU - Макфарланд Д. - Новая большая книга CSS - 2016

  Данный курс не сделает вас джуниором, мидлом или сеньором,
  эти звания скорее про опыт и умение самостоятельно решать разноозные задачи
  Но, к сожалению, нельзя уметь решать задачи, если не знать основы
  Этот курс учит основам, которые помогут стать тем кем вы хотите
  В разных компаниях по разному оцениваются эти звания, поэтому это очень размытые и относительные понятия
  По моим личным ощущениям задачи уровня b - это уровень junior, задачи уровня c - скорее ближе к middle
  Но скорее всего на собеседовании у вас будут справшивать все
*/
